Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/birth_family_relationships/registrar_birth_marr_death.html.txt.tmx
Source language: en
Languages: ga

source: Registrars of Births, Marriages and Deaths
ga: Cláraitheoirí Breitheanna, Póstaí agus Básanna

source: It is a legal requirement in Ireland that a record be kept of each birth, marriage and death that occurs in the State
ga: Tá riachtanas dlíthiúil in Éirinn go gcoimeádtar taifead ar gach breith, pósadh agus bás a tharlaíonn sa Stát

source: Up to 5 December 2005, these events were recorded locally in the district where they occurred
ga: Bhíodh na nithe seo á dtaifead go háitiúil sa cheantar inar tharla siad go dtí 5 Nollaig 2005

source: Since that date they can be recorded in any Registrar's District
ga: Ón dáta sin i leith is féidir iad a thaifeadadh i gceantar aon Chláraitheora

source: Records of all births, marriages and deaths are held nationally in the General Register Office, the central civil repository for records relating to Births, Deaths and Marriages in Ireland
ga: Tá taifid ar gach breith, pósadh agus bás á gcoinneáil ar bhonn náisiúnta in Oifig An Ard-Chláraitheora chomh maith. Is ionad lárnach sibhialta é an oifig sin chun taifid maidir le Breitheanna, Básanna agus Póstaí in Éirinn a stóráil

source: The Civil Registration Act 2004 changed some of the rules about registering a birth or death
ga: Athraíonn An tAcht um Chlárú Sibhialta 2004 cuid de na rialacha maidir le breith agus bás a chlárú

source: These changes took effect from 5 December 2005. They took effect for marriages from 5 November 2007
ga: Tháinig na hathruithe seo i bhfeidhm an 5 Nollaig 2005 agus le daoine pósta i bhfeidhm an 5 Samhain 2007

source: When a birth, marriage or death is recorded in Ireland, a certificate is issued to the individual(s) concerned (i.e
ga: Nuair a dhéantar breith, pósadh nó bás a thaifeadadh in Éirinn eisítear teastas don duine, nó do na daoine, lena mbaineann (.i

source: the parents in the event of a birth, the couple in the event of a marriage and the next-of-kin in the event of a death)
ga: na tuismitheoirí i gcás breithe, an lánúin i gcás pósta, agus na neasghaolta i gcás báis)

source: This record of the birth, death or marriage is a very important legal document and should be kept in a safe place
ga: Is cáipéis dlí thábhachtach é an taifead seo ar bhreith, bás nó pósadh agus ba chóir é a choinneáil in áit shábháilte

source: A birth certificate is required if you wish to enrol your child in school, apply for an Irish passport, etc
ga: Beidh teastas breithe ag teastáil más mian leat do leanbh a chlárú i scoil, má tá tú ag cur isteach ar phas Éireannach, srl

source: A death certificate is required if you are dealing with the deceased person's estate, etc
ga: Bíonn teastas báis ag teastáil má bhíonn tú ag plé le heastáit duine mhairbh

source: If you need to apply for a birth, marriage or death certificate, or a copy of these certificates you can apply online or get in touch with the appropriate Registrar in any Registrar's District
ga: Más gá duit iarratas a dhéanamh ar theastas breithe, pósta nó báis, nó ar chóip de cheann de na teastais sin, ní mór duit dul i dteagmháil leis an gCláraitheoir sa cheantar ina tharla an tarlúint (nó i gCeantar aon Chláraitheora, ó 5 Nollaig 2005 i leith)

source: You can also apply to the General Register Office in Roscommon
ga: Ina ionad sin, féadfaidh tú iarratas a dhéanamh chuig Oifig an Ard-Chláraitheora i Ros Comáin

source: Adopted children's Birth Certificates are only available from the General Register Office
ga: Ní féidir leat teastas breithe a fháil do leanbh uchtaithe ach ó Oifig an Ard-Chláraitheora

source: You will be required to pay a fee if you require a copy of these certificates
ga: Beidh ort táille íseal a íoc má tá cóip de cheann de na teastais sin uait

source: Records of marriages (other than Roman Catholic) held in the General Register Office (Roscommon) date back to 1 April 1845
ga: Téann taifid phóstaí (seachas póstaí Caitliceacha Rómhánacha) a choimeádtar in Oifig an Ard-Chláraitheora i Ros Comáin siar chomh fada le 1 Aibreán 1845

source: Records of births, deaths and Roman Catholic marriages date back to 1 January 1864
ga: Téann taifid bhreithe, bhásanna agus na bpóstaí Caitliceacha Rómhánacha siar go 1 Eanáir 1864

source: The General Register Office does not engage in family history research
ga: Ní dhéanann Oifig an Ard-Chláraitheora taighde ar stair chlainne

source: Registration of births, marriages and deaths
ga: Clárú breitheanna, póstaí agus básanna

source: Further information on registering the birth of your baby is available here
ga: Is féidir breis eolais maidir le breith do linbh a chlárú a fháil anseo

source: Further information on marriage registration in Ireland (and the recognition of marriages abroad in Ireland) is available here
ga: Is féidir breis eolais maidir le clárú pósta in Éirinn (agus aitheantas in Éirinn do phóstaí thar lear) le fáil anseo

source: Information on how to register a death in Ireland is available here
ga: Tá eolas faoi conas bás a chlárú in Éirinn le fáil anseo

source: The Registrar you need to contact used to be determined by where the event took place - not where you lived at the time, or where you live now
ga: Bhíodh ort dul i dteagmháil leis an gCláraitheoir san áit inar tharla an tarlúint - agus ní san áit a raibh tú i do chónaí ann ag an am, nó an áit a bhfuil cónaí ort ann anois

source: Since 5 December 2005 you may contact any Registrar
ga: (Ón 5 Nollaig 2005 ar aghaidh féadfaidh tú dul i dteagmháil le Cláraitheoir ar bith.) Is féidir teastas breithe a fháil go díreach ón gCláraitheoir a luaithe is a chláraítear an bhreith

source: Birth Certificates may be obtained, once the registration of the birth has taken place, from the Registrar directly or from any Registrar's Office
ga: Is féidir teastais a fháil ó Oifig an Phríomh-Chláraitheora, i gceann tuairim is trí mhí ó am an chláraithe. Tá sonraí ar fáil thíos

source: If you have any difficulty in determining the identity of a Registrar you should contact the local Superintendent Registrar's Office as detailed below for the required information
ga: Má tá deacracht agat a fháil amach cé hé an Cláraitheoir ba chóir duit dul i dteagmháil le hOifig an Phríomh-Chláraitheora áitiúil chun an fhaisnéis chuí a fháil. Tá sonraí ar fáil thíos

source: There is no fee charged for the registration of a birth, marriage or death, or for re-registration of a birth to include a parent's details
ga: Ní ghearrtar aon táillí ar chlárú breithe, pósta ná báis, nó d’athchlárú breithe chun sonraí tuismitheora a chur san áireamh

source: Fees are charged for copies of certificates
ga: Gearrtar táillí ar chóipeanna teastais

source: A certificate is issued for social welfare purposes at a reduced cost
ga: Eisítear teatas do chuspóirí leasa shóisialaigh ar chostas laghdaithe

source: Evidence it is for social welfare purposes is required, such as a note from the Department of Social Protection
ga: Teastaíonn fianaise gur mar gheall ar chuspóirí leasa shóisialaigh atá se ag teastáil, cosúil le nóta ón Roinn Coimirce Sóisialaigh

source: The fees charged for a certificate are:
ga: Is iad na táillí a ghearrtar ar theastas ná:

source: • €1 for a copy for social welfare purposes, including registration for a Public Services Card (letter from Department of Social Protection required)
ga: • €1 do chóip chun críocha leasa shóisialaigh, lena n-áirítear clárú do Chárta Seirbhísí Poiblí (litir ón Roinn Coimirce Sóisialaí ag teastáil)

source: • €4 for an uncertified copy of an entry in the Register
ga: • €4 do chóip neamhdheimhnithe d’iontráil isteach sa Clár

source: • €10 to have a certificate authenticated (only available from the General Register Office)
ga: • €10 go bhfuil deimhniú fíordheimhnithe (ar fáil ón Oifig Chlár Ghinearálta amháin)

source: • €10 for a certified copy of an entry in the Adopted Children Register (can be used for legal and administrative purposes)
ga: • €10 ar chóip dheimhnithe de thaifead sa Chlár d'Uchtleanaí (is féidir a úsáid chun críocha dlí agus riaracháin)

source: Copies of birth, marriage and death certificates in Ireland may be obtained from any Registrar (see below) and can also be obtained from the General Register Office
ga: Is féidir cóipeanna de theastais bhreithe, phósta agus bháis a fháil ó aon Chláraitheoir (féach thíos) agus is fédir iad a fháil freisin ón Oifig Chlár Ghinearálta

source: As these are public records anybody can apply
ga: Mar gheall gur taifid phoiblí atá iontu seo, is féidir le haon duine cur isteach orthu

source: You can download the appropriate application form here
ga: Is féidir leat an fhoirm iarratais chuí a íoslódáil anseo

source: You can also apply online for copies of certificates, including domestic adoptions and stillbirths that have been registered
ga: Is féidir leat cur isteach ar-líne ar chóipeanna de theastais, ina n-áirítear aon uchtaithe intíre agus marbh-bhreitheanna atá cláraithe

source: Contact information for Registrars of Births, Marriages and Deaths is available here, including addresses, opening hours, etc
ga: Tá eolas teagmhála le haghaidh Cláraitheoirí Breitheanna, Póstaí agus Básanna ar fáil anseo, lena n-áirítear seoltaí, uaireanta oscailte, srl
